{
  "backend/main.mo": "Motoko actor managing user profiles, authorization, and per‑user game save states with metadata and blob storage.",
  "feature_evidence.json": "Feature evidence report listing implemented CRT display and asset‑rendering features with associated files and components.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing each frontend source file’s purpose within the app.",
  "frontend/index.css": "Tailwind base and theme variable definitions establishing retro‑themed light/dark color palettes and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main client script.",
  "frontend/src/App.tsx": "Top‑level React component handling theme, navigation between screens, and profile setup dialog orchestration.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that triggers Internet Identity auth and clears queries on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to set a display name and save their profile.",
  "frontend/src/components/Brand/Icon.tsx": "Icon component rendering items from a sprite sheet via background positioning.",
  "frontend/src/components/Brand/Logo.tsx": "Small logo component displaying the generated app logo image at variable sizes.",
  "frontend/src/components/CloudSyncIndicator.tsx": "Indicator showing whether the user is authenticated and save states sync to cloud or local only.",
  "frontend/src/components/Layout/AppShell.tsx": "App layout providing header, nav tabs, footer, and wrapping screen content with login and sync indicators.",
  "frontend/src/components/TouchController.tsx": "On‑screen touch controller dispatching custom button events for emulator input.",
  "frontend/src/emulator/EmulatorCore.ts": "Basic emulator mock that loads ROMs, renders animated visuals, manages state, and handles input.",
  "frontend/src/emulator/inputMappings.ts": "Defines default keyboard-to-button mappings and provides a lookup helper.",
  "frontend/src/emulator/useEmulator.ts": "React hook that initializes the emulator, loads ROMs, and exposes controls and state management.",
  "frontend/src/emulator/useEmulatorInput.ts": "Hook that binds keyboard and custom events to emulator input handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, status tracking, and identity context management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating game entries and save states via the backend actor.",
  "frontend/src/hooks/useSaveStates.ts": "Manages save states locally or in the cloud depending on auth status, with create/load/delete operations.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching and updating the authenticated user's profile via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, custom retro-themed CSS variables for light/dark modes, base styling, and a CRT scanline effect.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/screens/HelpScreen.tsx": "Renders help content including ROM usage disclaimer, loading instructions, control mappings, and save-state explanations.",
  "frontend/src/screens/LibraryScreen.tsx": "Displays the user's ROM library with options to load, play, and remove games, using IndexedDB-backed data hooks.",
  "frontend/src/screens/PlayScreen.tsx": "Provides the emulator play UI, handling ROM loading, save states, controls, and rendering the emulator canvas.",
  "frontend/src/screens/SettingsScreen.tsx": "Shows emulator settings for audio, video scaling, and control configuration with update hooks.",
  "frontend/src/storage/romLibrary.ts": "Implements IndexedDB-based storage for ROMs with React Query hooks for listing, reading, saving, and deleting games.",
  "frontend/src/storage/saveStates.ts": "Implements IndexedDB storage for save states, including create, read, update, and delete operations keyed by id and indexed by gameId.",
  "frontend/src/storage/settings.ts": "Provides a React hook for loading, persisting, and updating user settings using localStorage with default values.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "JSON metadata describing the overall project state, features, requirements, and image asset needs for the emulator project."
}